In [1]:

import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text


engine = create_engine(
    "postgresql+psycopg2://postgres:root@localhost:3006/postgres"
)

def sql(query):
    with engine.connect() as conn:
        return pd.read_sql(text(query), conn)

print("Connexion SQLAlchemy OK ")

Connexion SQLAlchemy OK

## Job 1 — Requêtes simples

In [2]:

# Chargement du CSV
df_world = pd.read_csv("countries of the world.csv")
#apperçu des données
df_world.head()
#nettoyage et traitement des données 
df_world = df_world.rename(columns={
    'Country': 'country',
    'Region': 'region',
    'Population': 'population',
    'Area (sq. mi.)': 'area',
    'Pop. Density (per sq. mi.)': 'population_density',
    'Coastline (coast/area ratio)': 'coastline_ratio',
    'Net migration': 'net_migration',
    'Infant mortality (per 1000 births)': 'infant_mortality',
    'GDP ($ per capita)': 'gdp_per_capita',
    'Literacy (%)': 'literacy_rate',
    'Phones (per 1000)': 'phones_per_1000',
    'Arable (%)': 'arable_pct',
    'Crops (%)': 'crops_pct',
    'Other (%)': 'other_land_pct',
    'Climate': 'climate',
    'Birthrate': 'birth_rate',
    'Deathrate': 'death_rate',
    'Agriculture': 'agriculture_pct',
    'Industry': 'industry_pct',
    'Service': 'service_pct'
})



# Injection dans PostgreSQL
df_world.to_sql(
    "world",
    engine,
    if_exists="replace",   
    index=False
)

print("Table world créée et alimentée depuis le CSV ")

Table world créée et alimentée depuis le CSV

In [52]:
df_world.head()

,country,region,population,area,population_density,coastline_ratio,net_migration,infant_mortality,gdp_per_capita,literacy_rate,phones_per_1000,arable_pct,crops_pct,other_land_pct,climate,birth_rate,death_rate,agriculture_pct,industry_pct,service_pct
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
4,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN

In [3]:
# affichage de la population d' Allemagne
pop_allemage = sql("""
SELECT "country", "population"
FROM world
WHERE "country" = 'Germany ';
""")
# 2. Nom et population de Sweden, Norway, Denmark
pop_nordique = sql("""
SELECT "country", "population"
FROM world
WHERE "country" IN ('Sweden ', 'Norway ', 'Denmark ');
""")
# 3. Pays avec superficie entre 200 000 et 300 000
superficie = sql("""
SELECT "country", "area"
FROM world
WHERE "area" BETWEEN 200000 AND 300000;
""")
print(f"la population d'allemagne est de :\n {pop_allemage}")
print(f" les populations de certains pays nordique sont de :\n {pop_nordique}")
print(f" les pays ayant des superficies compris entre 200K et 300K sont :\n{superficie}")

la population d'allemagne est de :
     country  population
0  Germany     82422299
 les populations de certains pays nordique sont de :
     country  population
0  Denmark      5450661
1   Norway      4610820
2   Sweden      9016596
 les pays ayant des superficies compris entre 200K et 300K sont :
            country    area
0          Belarus   207600
1     Burkina Faso   274200
2          Ecuador   283560
3            Gabon   267667
4            Ghana   239460
5           Guinea   245857
6           Guyana   214970
7             Laos   236800
8      New Zealand   268680
9             Oman   212460
10     Philippines   300000
11         Romania   237500
12          Uganda   236040
13  United Kingdom   244820
14  Western Sahara   266000

## Job 2 — Filtres textuels

In [75]:
#la liste des pays dont le nom commence par B
pays_B = sql("""
    SELECT "country" FROM world 
    WHERE "country" LIKE 'B%';
    """)
print(f"la liste des pays dont le nom commence par B:\n {pays_B}")
# la liste des pays dont le nom commence par Al
pays_Al = sql("""
    SELECT "country" FROM world 
    WHERE "country" LIKE 'Al%';
    """)
print(f"la liste des pays dont le nom commence par Al:\n {pays_Al}")
# la liste dess pays dont le nom finit par y
pays_y = sql("""
SELECT country
FROM world
WHERE TRIM(country) LIKE '%y';
""")
print(f"la liste des pays dont le nom fini par y:\n {pays_y}")
pays_land = sql("""
SELECT country
FROM world
WHERE TRIM(country) LIKE '%land';
""")
print(f"la liste des pays dont le nom fini par land:\n {pays_land}")
pays_w = sql("""
SELECT country
FROM world
WHERE TRIM(country) LIKE '%w%';
""")
print(f"la liste des pays dont le nom contient w:\n {pays_w}")
#liste des pays dont le nom contient oo ou ee
pays_oo_ee = sql("""
SELECT country
FROM world
WHERE TRIM(country) LIKE '%oo%'
OR TRIM(country) LIKE '%ee%';
""")
print(f"la liste des pays dont le nom contient oo ou ee:\n {pays_oo_ee}")

#liste des pays dont le nom contient 3 a 
pays_3a = sql("""SELECT country FROM world
              WHERE REGEXP_COUNT(LOWER(country),'a')>=3
              """)
print(f"les pays dont le nom contient au moins trois a sont:\n {pays_3a}")
# pays dont la seconde lettre de son nom est R
pays_r = sql("""SELECT country FROM world
             WHERE country LIKE 'U%'
             """)
print(f"les pays avec un R en deuxiéme position dans leur nom sont:\n {pays_r}")

la liste des pays dont le nom commence par B:
                   country
0           Bahamas, The
1                Bahrain
2             Bangladesh
3               Barbados
4                Belarus
5                Belgium
6                 Belize
7                  Benin
8                Bermuda
9                 Bhutan
10               Bolivia
11  Bosnia & Herzegovina
12              Botswana
13                Brazil
14    British Virgin Is.
15                Brunei
16              Bulgaria
17          Burkina Faso
18                 Burma
19               Burundi
la liste des pays dont le nom commence par Al:
     country
0  Albania
1  Algeria
la liste des pays dont le nom fini par y:
      country
0   Germany
1  Guernsey
2   Hungary
3     Italy
4    Jersey
5    Norway
6  Paraguay
7    Turkey
8   Uruguay
la liste des pays dont le nom fini par land:
         country
0      Finland
1    Greenland
2      Iceland
3      Ireland
4  New Zealand
5       Poland
6    Swaziland
7  Switzerland
8     Thailand
la liste des pays dont le nom contient w:
               country
0           Botswana
1             Kuwait
2             Malawi
3      New Caledonia
4        New Zealand
5             Norway
6   Papua New Guinea
7             Rwanda
8          Swaziland
9             Sweden
10       Switzerland
11            Taiwan
12          Zimbabwe
la liste des pays dont le nom contient oo ou ee:
          country
0      Cameroon
1  Cook Islands
2        Greece
3     Greenland
les pays dont le nom contient au moins trois a sont:
                               country
0                        Afghanistan
1                            Albania
2                     American Samoa
3                  Antigua & Barbuda
4                          Australia
5                         Azerbaijan
6                       Bahamas, The
7                             Canada
8                     Cayman Islands
9               Central African Rep.
10                 Equatorial Guinea
11                         Guatemala
12                           Jamaica
13                        Kazakhstan
14                        Madagascar
15                          Malaysia
16                  Marshall Islands
17                        Mauritania
18                         Nicaragua
19                N. Mariana Islands
20                            Panama
21                  Papua New Guinea
22                          Paraguay
23  Saint Vincent and the Grenadines
24                      Saudi Arabia
25                          Tanzania
26              United Arab Emirates
27                 Wallis and Futuna
28                    Western Sahara
les pays avec un R en deuxiéme position dans leur nom sont:
                  country
0                Uganda
1               Ukraine
2  United Arab Emirates
3        United Kingdom
4         United States
5               Uruguay
6            Uzbekistan

## Job 3 — Table students

In [5]:
def exec_sql(query):
    with engine.begin() as conn:  # begin() = commit automatique
        conn.execute(text(query))

exec_sql("""
CREATE TABLE IF NOT EXISTS students (
    student_id INTEGER PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INTEGER,
    grade VARCHAR(2)
);
""")
exec_sql("""
INSERT INTO students (student_id, first_name, last_name, age, grade) VALUES
(1, 'Alice', 'Johnson', 22, 'A+'),
(2, 'Bob', 'Smith', 20, 'B'),
(3, 'Charlie', 'Williams', 21, 'C'),
(4, 'David', 'Brown', 23, 'B+'),
(5, 'Eva', 'Davis', 19, 'A'),
(6, 'Frank', 'Jones', 22, 'C+')
ON CONFLICT (student_id) DO NOTHING;
""")

In [17]:
# affichage de toutes les colonnes de students
colonnes = sql("""SELECT * FROM students;
    """)
print(f"toutes les colonnes de students :\n {colonnes}")

#les éleves ayant plus de 20ans
age_20 = sql("""SELECT  first_name, last_name, age FROM students 
    WHERE age > 20;
    """)
print(f"les éleves ayant plus de 20ans\n {age_20}")
# classement des éléves selon leurs notes par ordre croissant
class_croissant = sql(""" SELECT * FROM students
                      ORDER BY
                      CASE grade
        WHEN 'A+' THEN 1
        WHEN 'A'  THEN 2
        WHEN 'B+' THEN 3
        WHEN 'B'  THEN 4
        WHEN 'C+' THEN 5
        WHEN 'C'  THEN 6
        ELSE 7
    END DESC;
                      """)
print(f" classement des eleves par note croissante\n {class_croissant}")
# Classement des eleves par notes decroissante
class_decroissant = sql(""" SELECT * FROM students
                      ORDER BY
                      CASE grade
        WHEN 'A+' THEN 1
        WHEN 'A'  THEN 2
        WHEN 'B+' THEN 3
        WHEN 'B'  THEN 4
        WHEN 'C+' THEN 5
        WHEN 'C'  THEN 6
        ELSE 7
    END;
                      """)
print(f" classement des meilleur eleves par note decroissant\n {class_decroissant}")
# Classement des eleves par notes decroissante

toutes les colonnes de students :
    student_id first_name last_name  age grade
0           1      Alice   Johnson   22    A+
1           2        Bob     Smith   20     B
2           3    Charlie  Williams   21     C
3           4      David     Brown   23    B+
4           5        Eva     Davis   19     A
5           6      Frank     Jones   22    C+
les éleves ayant plus de 20ans
   first_name last_name  age
0      Alice   Johnson   22
1    Charlie  Williams   21
2      David     Brown   23
3      Frank     Jones   22
 classement des eleves par note croissante
    student_id first_name last_name  age grade
0           3    Charlie  Williams   21     C
1           6      Frank     Jones   22    C+
2           2        Bob     Smith   20     B
3           4      David     Brown   23    B+
4           5        Eva     Davis   19     A
5           1      Alice   Johnson   22    A+
 classement des meilleur eleves par note decroissant
    student_id first_name last_name  age grade
0           1      Alice   Johnson   22    A+
1           5        Eva     Davis   19     A
2           4      David     Brown   23    B+
3           2        Bob     Smith   20     B
4           6      Frank     Jones   22    C+
5           3    Charlie  Williams   21     C

## Job 4 — Table nobel

In [24]:

exec_sql("""
DROP TABLE IF EXISTS nobel;
CREATE TABLE  nobel (
         yr INTEGER, 
         subject VARCHAR(50), 
         winner VARCHAR(100));
         """)

exec_sql("""
INSERT INTO nobel (yr, subject, winner) VALUES
(1960, 'Chemistry', 'Willard F. Libby'),
(1960, 'Literature', 'Saint-John Perse'),
(1960, 'Medicine', 'Sir Frank Macfarlane Burnet'),
(1960, 'Medicine', 'Peter Madawar');
""")

In [25]:
sql(""" SELECT * FROM nobel
    WHERE yr = 1960
""")

     yr     subject                       winner
0  1960   Chemistry             Willard F. Libby
1  1960  Literature             Saint-John Perse
2  1960    Medicine  Sir Frank Macfarlane Burnet
3  1960    Medicine                Peter Madawar

In [ ]:
sql(""" SELECT * FROM nobel
    WHERE subject = 'Literature' AND yr = 1960;
    """)

     yr     subject            winner
0  1960  Literature  Saint-John Perse

In [29]:
sql(""" SELECT  yr, subject FROM nobel
    WHERE winner = 'Albert Einstein';
    """)

Empty DataFrame
Columns: [yr, subject]
Index: []

In [34]:
sql(""" SELECT * FROM nobel
    WHERE subject = 'Literature' AND yr BETWEEN 1980 AND 1989;
    """)

Empty DataFrame
Columns: [yr, subject, winner]
Index: []

In [36]:
sql(""" SELECT * FROM nobel
    COUNT(winner)
    WHERE subject = 'Mathématique'
    ;
    """)

Empty DataFrame
Columns: [winner, subject, winner]
Index: []

## Job 5 — Comparaisons

In [ ]:
# les pays ave des pop plus grand que celle de la Russi

sql("""
SELECT country, population
FROM world
WHERE population >
    (SELECT population FROM world WHERE country = 'Russia ');
""")

          country  population
0     Bangladesh    147365352
1         Brazil    188078227
2          China   1313973713
3          India   1095351995
4      Indonesia    245452739
5       Pakistan    165803560
6  United States    298444215

In [71]:
# Les pays d'europe dont le PIB est superieur à celle de l'italie
sql("""
SELECT country, region, gdp_per_capita
FROM world
WHERE TRIM(region) LIKE '%EUROPE'
    AND gdp_per_capita > 
    (SELECT gdp_per_capita
    FROM world
    WHERE TRIM(country) = 'Italy');
""")

            country                               region  gdp_per_capita
0          Austria   WESTERN EUROPE                              30000.0
1          Belgium   WESTERN EUROPE                              29100.0
2          Denmark   WESTERN EUROPE                              31100.0
3          Finland   WESTERN EUROPE                              27400.0
4           France   WESTERN EUROPE                              27600.0
5          Germany   WESTERN EUROPE                              27600.0
6          Iceland   WESTERN EUROPE                              30900.0
7          Ireland   WESTERN EUROPE                              29600.0
8       Luxembourg   WESTERN EUROPE                              55100.0
9           Monaco   WESTERN EUROPE                              27000.0
10     Netherlands   WESTERN EUROPE                              28600.0
11          Norway   WESTERN EUROPE                              37800.0
12      San Marino   WESTERN EUROPE                              34600.0
13          Sweden   WESTERN EUROPE                              26800.0
14     Switzerland   WESTERN EUROPE                              32700.0
15  United Kingdom   WESTERN EUROPE                              27700.0

In [76]:
#Les pays ayant une population superieur à celle du royaume uni mais inferieur à celle de l'allemagne
sql("""SELECT country, population FROM world 
    WHERE population > (SELECT population FROM world WHERE  TRIM(country) = 'United Kingdom')
    AND population < (SELECT population FROM world WHERE  TRIM(country) = 'Germany');
    """)

             country  population
0  Congo, Dem. Rep.     62660551
1             Egypt     78887007
2          Ethiopia     74777981
3            France     60876136
4              Iran     68688433
5          Thailand     64631595
6            Turkey     70413958

In [94]:
# population des pays d'europe en pourcentage d ela population d'allemagne
sql("""
SELECT country, population,
    ROUND( 
    population *100.0 / 
    (SELECT population FROM world WHERE country = 'Germany '),
    2
    )
    as population_percent_of_Germany 
    FROM world
    WHERE TRIM(region) LIKE '%EUROPE';
    """)

                  country  population  population_percent_of_germany
0                Albania      3581655                           4.35
1                Andorra        71201                           0.09
2                Austria      8192880                           9.94
3                Belgium     10379067                          12.59
4   Bosnia & Herzegovina      4498976                           5.46
5               Bulgaria      7385367                           8.96
6                Croatia      4494749                           5.45
7         Czech Republic     10235455                          12.42
8                Denmark      5450661                           6.61
9          Faroe Islands        47246                           0.06
10               Finland      5231372                           6.35
11                France     60876136                          73.86
12               Germany     82422299                         100.00
13             Gibraltar        27928                           0.03
14                Greece     10688058                          12.97
15              Guernsey        65409                           0.08
16               Hungary      9981334                          12.11
17               Iceland       299388                           0.36
18               Ireland      4062235                           4.93
19           Isle of Man        75441                           0.09
20                 Italy     58133509                          70.53
21                Jersey        91084                           0.11
22         Liechtenstein        33987                           0.04
23            Luxembourg       474413                           0.58
24             Macedonia      2050554                           2.49
25                 Malta       400214                           0.49
26                Monaco        32543                           0.04
27           Netherlands     16491461                          20.01
28                Norway      4610820                           5.59
29                Poland     38536869                          46.76
30              Portugal     10605870                          12.87
31               Romania     22303552                          27.06
32            San Marino        29251                           0.04
33                Serbia      9396411                          11.40
34              Slovakia      5439448                           6.60
35              Slovenia      2010347                           2.44
36                 Spain     40397842                          49.01
37                Sweden      9016596                          10.94
38           Switzerland      7523934                           9.13
39        United Kingdom     60609153                          73.53

In [97]:
# les continants dont tous les pays ont ue population de moins de 25000 habitants 
sql("""
SELECT continent
FROM (
    SELECT
        CASE
            WHEN TRIM(region) LIKE '%EUROPE%' THEN 'Europe'
            WHEN TRIM(region) LIKE '%AFRICA%' THEN 'Africa'
            WHEN TRIM(region) LIKE '%ASIA%' THEN 'Asia'
            WHEN TRIM(region) LIKE '%AMERICA%' THEN 'America'
            WHEN TRIM(region) LIKE '%OCEANIA%' THEN 'Oceania'
    
            ELSE 'Other'
        END AS continent,
        population
    FROM world
) sub
GROUP BY continent
HAVING MAX(population) <= 25000000;

    """)

  continent
0   Oceania

## Job 6 — Agrégations

In [99]:
# La population totale mondiale 
sql("""
    SELECT SUM(population) AS population_mondiale
FROM world;

""")

   population_mondiale
0         6.524045e+09

In [105]:
sql("""
    SELECT
    continent,
    population_du_continent
FROM (
    SELECT
        CASE
            WHEN region ILIKE '%Europe%' THEN 'Europe'
            WHEN region ILIKE '%Africa%' THEN 'Africa'
            WHEN region ILIKE '%Asia%' THEN 'Asia'
            WHEN region ILIKE '%America%' THEN 'America'
            WHEN region ILIKE '%Oceania%' THEN 'Oceania'
            ELSE 'Other'
        END AS continent,
        SUM(population) AS population_du_continent
    FROM world
    GROUP BY continent
) sub
ORDER BY population_du_continent DESC;

""")

  continent  population_du_continent
0      Asia             3.687982e+09
1     Other             1.044159e+09
2    Africa             9.108441e+08
3    Europe             5.162547e+08
4   America             3.316723e+08
5   Oceania             3.313166e+07

In [ ]:
# PIB total par continant 
sql("""
    SELECT
    continent,
    pib_du_continent
FROM (
    SELECT
        CASE
            WHEN region ILIKE '%Europe%' THEN 'Europe'
            WHEN region ILIKE '%Africa%' THEN 'Africa'
            WHEN region ILIKE '%Asia%' THEN 'Asia'
            WHEN region ILIKE '%America%' THEN 'America'
            WHEN region ILIKE '%Oceania%' THEN 'Oceania'
            ELSE 'Other'
        END AS continent,
        SUM(population*gdp_per_capita) AS pib_total_du_continent
    FROM world
    GROUP BY continent
) sub
ORDER BY pib_du_continent DESC;
""")

  continent  pib_du_continent
0      Asia      1.858503e+13
1   America      1.227108e+13
2    Europe      1.182289e+13
3     Other      7.273546e+12
4    Africa      2.047227e+12
5   Oceania      7.102268e+11

In [114]:
#PIB total du continent africain
sql("""
    SELECT
    'Afrique' AS continent,
    SUM(population * gdp_per_capita) AS pib_total_afrique
FROM world
WHERE region ILIKE '%Africa%';

    """)

  continent  pib_total_afrique
0   Afrique       2.047227e+12

## Job 7 — Jointures UEFA

In [ ]:

sql("""
SELECT g.matchid, g.player
FROM goal g
WHERE g.teamid = 'GER';
""")

## Job 8 — SomeCompany

## Job 9 — Analyse exploratoire